from 分言語.語言判斷有固定字數 import 判斷
from 翻譯研究.讀語料 import 讀語料
import time
from 分言語.語言判斷模型 import 無例句訓練的語料
import random
from 臺灣言語工具.音標系統.閩南語.教會羅馬字音標 import 教會羅馬字音標
from 機器學習.訓練模型 import 訓練模型
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.解析整理.字物件篩仔 import 字物件篩仔
from 臺灣言語工具.解析整理.物件譀鏡 import 物件譀鏡
from 臺灣言語工具.解析整理.文章粗胚 import 文章粗胚
from 臺灣言語工具.基本元素.公用變數 import 分字符號

class 訓練模型有固定字數(訓練模型):
	_分析器 = 拆文分析器()
	_篩仔 = 字物件篩仔()
	_讀語料 = 讀語料()
	_粗胚 = 文章粗胚()
	_譀鏡 = 物件譀鏡()
	def 確定分類(self, 國語檔, 閩南檔, 字數):
		分數資料 = []
		答案 = []
		for 國語句 in self._讀語料.讀語料檔案(國語檔):
			分數 = 判斷.分數(國語句, 字數)
			分數資料.append(分數)
			答案.append(0)
		print('國語訓練', len(答案))
		for 閩南句 in self._讀語料.讀語料檔案(閩南檔):
# 			if 閩南句 in 句對應分數:
# 				分數=句對應分數[閩南句]
# 			else:
			分數 = 判斷.分數(閩南句, 字數)
			分數資料.append(分數)
			答案.append(1)
		print('閩南語訓練', len(答案))
		return (分數資料, 答案)
	def 試驗提一段出來(self, 題目檔, 字數):
		分數資料 = []
		for 題目 in self._讀語料.讀語料檔案(題目檔):
# 			if 閩南句 in 句對應分數:
# 				分數=句對應分數[閩南句]
# 			else:
			分數 = 判斷.分數(題目, 字數)
			分數資料.append(分數)
		return 分數資料
	def 試驗著毋著(self, 函式, 分數資料, 答案, 前幾常用=None):
		if 前幾常用 != None:
			分數資料 = TGB.調整問題(分數資料, 前幾常用)
		毋著 = 0
		for 結果 in 函式(分數資料):
			if 結果 != 答案:
				毋著 += 1
		return 毋著, len(分數資料)
	def 提一段出來(self, 語句, 字數):
		處理減號 = self._粗胚.建立物件語句前處理減號(教會羅馬字音標, 語句)
		章物件 = self._分析器.建立章物件(處理減號)
		所在 = random.randrange(len(章物件.內底句))
		這馬字數 = 0
		句陣列 = []
		while 這馬字數 < 字數:
# 			print(len(章物件.內底句),所在)
			句陣列.append(self._譀鏡.看型(章物件.內底句[所在], 物件分字符號=分字符號))
			這馬字數 += len(self._篩仔.篩出字物件(章物件.內底句[所在]))
			所在 = (所在 + 1) % len(章物件.內底句)
# 		print(語句)
# 		print(' '.join(句陣列))
		return ' '.join(句陣列)
if __name__ == '__main__':
	if 無例句訓練的語料:
		raise RuntimeError('實驗設定是愛有例句訓練的語料')
	TGB = 訓練模型有固定字數()
# 	試驗函式 = TGB.訓練('../語料/TGB/逐句訓練分數.json.gz')
# 	TGB.試驗('../語料/TGB/全部句分數.json.gz', 試驗函式)
# 	TGB.加校對('0.txt', '1.txt', '2.txt', '3.txt',
# 		[27, 35, 48, 51, 68, 228, 239, 258, 317, 595, 663, 717, 804, 807, 989, 1077, 1108, 1150, 1160, 1225, 1228, 1454, 1518, 1575, 1605, 1719, 1724, 1859, 1971, 1975, 2256, 2347, 2594, 2605, 2656, 2689, 2719, 2849, 2867, 2919, 3042, 3160, 3179, 3317, 3339, 3541, 3547, 3559, 3656, 3659, 3699, 3896, 3959, 4028, 4153, 4365, 4366, 4367, 4579, 4835, 5174, 5177, 5212, 5276, 5287, 5604, 5692, 5701, 5721, 5765, 5895, 5971, 6083, 6112, 6137, 6494, 6605, 6704, 6815, 6923, 6992, 7002, 7012, 7026, 7127, 7165, 7188, 7222, 7303, 7434, 7461, 7496, 7613, 7694, 7804, 8073, 8087, 8088, 8186, 8197, 8213, 8324, 8421, 8439],
# 		[590, 636, 655, 810, 4489, 5858])
# 	TGB.重產生檔案('../語料/TGB/分國閩/國語', '../語料/TGB/分國閩/閩南', '../語料/TGB/分國閩/國語2', '../語料/TGB/分國閩/閩南2')
#  	分類 = TGB.試驗(試驗函式, '國4', '閩4')
	for 字數 in [5, 10, 20, 50, 100, 200, 500]:
		random.seed('tai5 uan5 ji7 it8 e5 kok4 ka1.')
		print('訓練語料', 字數)
		問題, 答案 = TGB.確定分類('../語料/TGB/分國閩/訓.國語.gz',
			'../語料/TGB/分國閩/訓.閩南.gz', 字數)
		print('試驗語料', 字數)
		試華 = TGB.試驗提一段出來('../語料/TGB/分國閩/試.國語.gz', 字數)
		試閩 = TGB.試驗提一段出來('../語料/TGB/分國閩/試.閩南.gz', 字數)
		for 定用詞 in [0, 10, 20, 50, 100, 200, 500, 1000, 2000, 3000]:
			訓練問題 = TGB.調整問題(問題, 定用詞)
			for 名, 方法 in zip(['SVM', ], [TGB.SVM模型]):
				print('字數', 字數, '試驗函式', 名, '定用詞', 定用詞, '訓練開始', time.ctime())
				試驗函式 = 方法(訓練問題, 答案)
				print('訓練結束', time.ctime())
				國毋著, 國全部 = TGB.試驗著毋著(試驗函式, 試華, 0, 定用詞)
				閩毋著, 閩全部 = TGB.試驗著毋著(試驗函式, 試閩, 1, 定用詞)
				print('毋著', 國毋著, 閩毋著, 國毋著 + 閩毋著, '全部', 國全部 + 閩全部,
					'錯誤率', (國毋著 + 閩毋著) / (國全部 + 閩全部), '時間', time.ctime())
