from 翻譯研究.讀語料 import 讀語料

class 分訓練試驗:
	def 分華臺(self,檔名):
		self.分語料(檔名, 57167)
	def 分教育部例句(self,檔名):
		self.分語料(檔名, 31200)
	def 分語料(self,檔名,切):
		語料=讀語料()
		資料=語料.讀語料檔案(檔名)
		語料.寫語料檔案(檔名.replace('語料/','語料/訓.'), '\n'.join(資料[:切]))
		語料.寫語料檔案(檔名.replace('語料/','語料/試.'), '\n'.join(資料[切:]))
		

if __name__=='__main__':
	訓練試驗=分訓練試驗()
	訓練試驗.分華臺('../語料/華臺國語字.txt.gz')
	訓練試驗.分華臺('../語料/華臺閩南語字.txt.gz')
	訓練試驗.分華臺('../語料/華臺閩南語音.txt.gz')
	訓練試驗.分教育部例句('../語料/例句國語字.txt.gz')
	訓練試驗.分教育部例句('../語料/例句閩南語字.txt.gz')
	訓練試驗.分教育部例句('../語料/例句閩南語音.txt.gz')