from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.解析整理.物件譀鏡 import 物件譀鏡
from 翻譯研究.讀語料 import 讀語料
from 資料處理.產生一對一 import 產生一對一
from 校對.公家辭典連詞 import 公家辭典連詞
from 資料處理.辭典照音排型 import 辭典照音排型

class 數位典藏一對一(產生一對一):
	_分析器 = 拆文分析器()
	_語料 = 讀語料()
	_公家辭典連詞 = 公家辭典連詞()
	_譀鏡 = 物件譀鏡()
	_辭典照音排型=辭典照音排型()
	def 檔案合起來(self, 型檔案, 音檔案, 一對一檔名):
		閩南語字 = self._語料.讀語料檔案(型檔案)
		閩南語音 = self._語料.讀語料檔案(音檔案)
		結果 = []
		逝數 = 0
		for 型, 音 in zip(閩南語字, 閩南語音):
			print(逝數)
			型 = ' ' + 型 + ' '
			音 = ' ' + 音 + ' '
			型陣列 = self._分析器.拆章做句(型)
			音陣列 = self._分析器.拆章做句(音)
			if len(型陣列) != len(音陣列):
				型陣列 = 音陣列
			for 型, 音 in zip(型陣列, 音陣列):
				try:
					結果.append(self.合起來(型, 音))
				except:
					結果.append(self.合起來(音, 音))
			逝數 += 1
		self._語料.寫語料檔案(一對一檔名, '\n'.join(結果))
		return
	def 檔案合起來而且無愛無佇辭典的字(self, 型檔案, 音檔案, 一對一檔名):
		閩南語字 = self._語料.讀語料檔案(型檔案)
		閩南語音 = self._語料.讀語料檔案(音檔案)
		結果 = []
		逝數 = 0
# 		辭典, 連詞=self._公家辭典連詞.讀文件產生()
		辭典 = self._公家辭典連詞.產生()[0]
		for 型, 音 in zip(閩南語字, 閩南語音):
			print(逝數)
			型 = ' ' + 型 + ' '
			音 = ' ' + 音 + ' '
			型陣列 = self._分析器.拆章做句(型)
			音陣列 = self._分析器.拆章做句(音)
			if len(型陣列) != len(音陣列):
				章物件 = self._辭典照音排型.對齊(辭典, 型, 音)
				結果.extend(章物件.內底句)
			for 型, 音 in zip(型陣列, 音陣列):
				章物件 = self._辭典照音排型.對齊(辭典, 型, 音)
				結果.extend(章物件.內底句)
			逝數 += 1
		斷詞格式 = []
		for 句物件 in 結果: 
			斷詞格式.append(self._譀鏡.看分詞(句物件, 物件分型音符號='｜'))
		self._語料.寫語料檔案(一對一檔名, '\n'.join(斷詞格式))
		return
if __name__ == '__main__':
	一對一 = 數位典藏一對一()
# 	一對一.檔案合起來("../語料/臺語文數位典藏漢羅文.txt.gz",
# 				"../語料/臺語文數位典藏全羅文.txt.gz",
# 				"../語料/臺語文數位典藏一對一.txt.gz")
	一對一.檔案合起來而且無愛無佇辭典的字("../語料/臺語文數位典藏漢羅文.txt.gz",
				"../語料/臺語文數位典藏全羅文.txt.gz",
				"../語料/臺語文數位典藏一對一.txt.gz")
	
