from 臺灣言語工具.字詞組集句章.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.字詞組集句章.解析整理.物件譀鏡 import 物件譀鏡
from 翻譯研究.讀語料 import 讀語料
from 資料處理.產生一對一 import 產生一對一
from 臺灣言語工具.字詞組集句章.解析整理.字物件篩仔 import 字物件篩仔

class 檢查腔口:
	__分析器=拆文分析器()
	__語料=讀語料()
	__篩仔 = 字物件篩仔()
	def 檢查檔案(self,一對一檔名,愛比的資料):
		for 一對一 in self.__語料.讀語料檔案(一對一檔名):
			self.檢查一句(一對一, 愛比的資料)
		return
	def 檢查一句(self,一對一,愛比的資料):
		句物件 = self.__分析器.轉做句物件(一對一)
		字陣列 = self.__篩仔.篩出字物件(句物件)
		斷字句 = []
		for 字物件 in 字陣列:
			for 愛比的 in 愛比的資料:
				if 字物件==愛比的[0]:
					愛比的[1]+=1
		return

if __name__=='__main__':
	分析器=拆文分析器()
	愛比的字=[
		分析器.產生對齊字('雞', 'ke1'),
		分析器.產生對齊字('雞', 'kue1'),
		分析器.產生對齊字('雞', 'kere1'),
		分析器.產生對齊字('煮', 'tsi2'),
		分析器.產生對齊字('煮', 'tsu2'),
		分析器.產生對齊字('煮', 'tsir2'),
		分析器.產生對齊字('火', 'hue2'),
		分析器.產生對齊字('火', 'he2'),
		分析器.產生對齊字('火', 'her2'),
		分析器.產生對齊字('近', 'kin7'),
		分析器.產生對齊字('近', 'kun7'),
		分析器.產生對齊字('近', 'kun6'),
		分析器.產生對齊字('近', 'kirn7'),
		分析器.產生對齊字('巾', 'kin1'),
		分析器.產生對齊字('巾', 'kun1'),
		分析器.產生對齊字('巾', 'kirn1'),
		分析器.產生對齊字('箸', 'ti7'),
		分析器.產生對齊字('箸', 'tu7'),
		分析器.產生對齊字('箸', 'tir6'),
		分析器.產生對齊字('箸', 'tir7'),
		分析器.產生對齊字('暝', 'me5'),
		分析器.產生對齊字('暝', 'mi5'),
		分析器.產生對齊字('魚', 'hi5'),
		分析器.產生對齊字('魚', 'hu5'),
		分析器.產生對齊字('魚', 'hir5'),
		分析器.產生對齊字('日', 'jit8'),
		分析器.產生對齊字('日', 'lit8'),
		分析器.產生對齊字('日', 'git8'),
		分析器.產生對齊字('月', 'gueh8'),
		分析器.產生對齊字('月', 'geh8'),
		分析器.產生對齊字('月', 'gerh8'),
		分析器.產生對齊字('月', 'ger7'),
		]
	檢查=檢查腔口()
	for 檔案 in [
			"../語料/附錄句一對一斷詞.txt.gz",
			"../語料/試.華臺一對一斷詞組.txt.gz",
			"../語料/訓.華臺一對一斷詞組.txt.gz",
			"../語料/臺語文數位典藏一對一.txt.gz",
			]:
		愛比的資料=[]
		for 字 in 愛比的字:
			愛比的資料.append([字,0])
		檢查.檢查檔案(檔案, 愛比的資料)
		print(檔案, 愛比的資料)
	