from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.解析整理.物件譀鏡 import 物件譀鏡
from 翻譯研究.讀語料 import 讀語料

class 產生一對一:
	__分析器=拆文分析器()
	__譀鏡=物件譀鏡()
	__語料=讀語料()
	def 合起來(self,型,音):
		句物件=self.__分析器.產生對齊句(型, 音)
		return self.__譀鏡.看斷詞(句物件, 物件分型音符號='｜')
	def 檔案合起來(self,型檔案,音檔案,一對一檔名):
		閩南語字=self.__語料.讀語料檔案(型檔案)
		閩南語音=self.__語料.讀語料檔案(音檔案)
		結果=[]
		for 型,音 in zip(閩南語字,閩南語音):
			結果.append(self.合起來(型, 音))
		self.__語料.寫語料檔案(一對一檔名, '\n'.join(結果))
		return

if __name__=='__main__':
	一對一=產生一對一()
	一對一.檔案合起來("../語料/訓.華臺閩南語字.txt",
				"../語料/訓.華臺閩南語音.txt",
				"../語料/訓.華臺一對一斷詞組.txt.gz")
	一對一.檔案合起來("../語料/訓.華臺閩南語字.txt",
				"../語料/訓.華臺閩南語音斷詞.txt",
				"../語料/訓.華臺一對一斷詞.txt.gz")
	一對一.檔案合起來("../語料/訓.華臺閩南語字.txt",
				"../語料/訓.華臺閩南語音斷字.txt",
				"../語料/訓.華臺一對一斷字.txt.gz")
	
	一對一.檔案合起來("../語料/試.華臺閩南語字.txt",
				"../語料/試.華臺閩南語音.txt",
				"../語料/試.華臺一對一斷詞組.txt.gz")
	一對一.檔案合起來("../語料/試.華臺閩南語字.txt",
				"../語料/試.華臺閩南語音斷詞.txt",
				"../語料/試.華臺一對一斷詞.txt.gz")
	一對一.檔案合起來("../語料/試.華臺閩南語字.txt",
				"../語料/試.華臺閩南語音斷字.txt",
				"../語料/試.華臺一對一斷字.txt.gz")

	一對一.檔案合起來("../語料/訓.例句閩南語字.txt.gz",
			"../語料/訓.例句閩南語音.txt.gz",
			"../語料/訓.例句一對一斷詞.txt.gz")
	一對一.檔案合起來("../語料/訓.例句閩南語字.txt.gz",
			"../語料/訓.例句閩南語音斷字.txt.gz",
			"../語料/訓.例句一對一斷字.txt.gz")
	一對一.檔案合起來("../語料/試.例句閩南語字.txt.gz",
			"../語料/試.例句閩南語音.txt.gz",
			"../語料/試.例句一對一斷詞.txt.gz")
	一對一.檔案合起來("../語料/試.例句閩南語字.txt.gz",
			"../語料/試.例句閩南語音斷字.txt.gz",
			"../語料/試.例句一對一斷字.txt.gz")

	一對一.檔案合起來("../語料/附錄句閩南語字.txt.gz",
			"../語料/附錄句閩南語音.txt.gz",
			"../語料/附錄句一對一斷詞.txt.gz")
	一對一.檔案合起來("../語料/附錄句閩南語字.txt.gz",
			"../語料/附錄句閩南語音斷字.txt.gz",
			"../語料/附錄句一對一斷字.txt.gz")
	
	一對一.檔案合起來("../語料/辭典閩南語字.txt.gz",
			"../語料/辭典閩南語音.txt.gz",
			"../語料/辭典一對一.txt.gz")
