from 翻譯研究.讀語料 import 讀語料
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.解析整理.物件譀鏡 import 物件譀鏡
import os
if __name__ == '__main__':	
	_語料 = 讀語料()
	_分析器 = 拆文分析器()
	譀鏡 = 物件譀鏡()
	for 檔名 in ['../語料/訓.華臺國語字斷詞.txt.gz', '../語料/試.華臺國語字斷詞.txt.gz',
			'../語料/訓.華臺國語字.txt.gz', '../語料/試.華臺國語字.txt.gz',
			'../語料/訓.例句國語字斷詞.txt.gz', '../語料/試.例句國語字斷詞.txt.gz']:
		新分詞 = []
		for 一逝 in _語料.讀語料檔案(檔名):
			媠 = _分析器.轉做句物件(一逝)
			批股 = 譀鏡.看分詞(媠)
			新分詞.append(批股)
		新檔名 = os.path.basename(檔名)
		_語料.寫語料檔案(新檔名, '\n'.join(新分詞))
