# -*- coding: utf-8 -*-
from 校對.公家辭典連詞 import 公家辭典連詞
from 校對.華臺斷詞 import 華臺斷詞
from 臺灣言語工具.表單.型音辭典 import 型音辭典
from 臺灣言語工具.斷詞.上長詞優先辭典揣詞 import 上長詞優先辭典揣詞
from 臺灣言語工具.表單.尾字辭典 import 尾字辭典
from 臺灣言語工具.斷詞.尾字辭典揣詞 import 尾字辭典揣詞
if __name__ == '__main__':
	辭典連詞 = 公家辭典連詞()
	華臺斷字詞 = 華臺斷詞()
	辭典, 連詞 = 辭典連詞.產生()
	華臺斷字詞.處理音標(辭典,
		'../語料/訓.華臺一對一斷詞組.txt.gz', '../語料/訓.華臺一對一斷詞.txt.gz')
	華臺斷字詞.處理音標(辭典,
		'../語料/試.華臺一對一斷詞組.txt.gz', '../語料/試.華臺一對一斷詞.txt.gz')
	華臺斷字詞.處理音標(辭典,
		'../語料/訓.華臺一對一斷詞組.txt.gz', '../語料/訓.華臺一對一上長詞對前斷詞.txt.gz',
		上長詞優先辭典揣詞)
	華臺斷字詞.處理音標(辭典,
		'../語料/試.華臺一對一斷詞組.txt.gz', '../語料/試.華臺一對一上長詞對前斷詞.txt.gz',
		上長詞優先辭典揣詞)
	
	辭典, 連詞 = 辭典連詞.讀文件產生(尾字辭典(型音辭典)(4))
	華臺斷字詞.處理音標(辭典,
		'../語料/訓.華臺一對一斷詞組.txt.gz', '../語料/訓.華臺一對一上長詞對後斷詞.txt.gz',
		尾字辭典揣詞(上長詞優先辭典揣詞))
	華臺斷字詞.處理音標(辭典,
		'../語料/試.華臺一對一斷詞組.txt.gz', '../語料/試.華臺一對一上長詞對後斷詞.txt.gz',
		尾字辭典揣詞(上長詞優先辭典揣詞))
	
