from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.綜合標音.句綜合標音 import 句綜合標音
from 臺灣言語工具.綜合標音.閩南語字綜合標音 import 閩南語字綜合標音
from 翻譯研究.讀語料 import 讀語料
import json

class 試驗答案轉綜合標音:
	_分析器 = 拆文分析器()
	def 轉(self, 一篇):
		標音 = []
		for 一句 in 一篇:
			標音.append(self.轉一句(一句))
		return 標音
	def 轉一句(self, 一句):
		句物件 = self._分析器.轉做句物件(一句)
		return 句綜合標音(閩南語字綜合標音, 句物件).轉json格式()
	
if __name__ == '__main__':
	_轉綜合音標 = 試驗答案轉綜合標音()
	_語料 = 讀語料()
	結果 = _轉綜合音標.轉(_語料.讀語料檔案('../語料/華臺/05.試.華臺一對一斷詞.txt.gz'))
	_語料.寫語料檔案('答案.json', json.dumps(結果))
	print(結果[:10])
	
# 有改
# 		diff --git "a/\350\207\272\347\201\243\350\250\200\350\252\236\345\267\245\345\205\267/\347\266\234\345\220\210\346\250\231\351\237\263/\351\226\251\345\215\227\350\252\236\345\255\227\347\266\234\345\220\210\346\250\231\351\237\263.py" "b/\350\207\272\347\201\243\350\250\200\350\252\236\345\267\245\345\205\267/\347\266\234\345\220\210\346\250\231\351\237\263/\351\226\251\345\215\227\350\252\236\345\255\227\347\266\234\345\220\210\346\250\231\351\237\263.py"
# index 935a87c..0a2d6d2 100644
# --- "a/\350\207\272\347\201\243\350\250\200\350\252\236\345\267\245\345\205\267/\347\266\234\345\220\210\346\250\231\351\237\263/\351\226\251\345\215\227\350\252\236\345\255\227\347\266\234\345\220\210\346\250\231\351\237\263.py"
# +++ "b/\350\207\272\347\201\243\350\250\200\350\252\236\345\267\245\345\205\267/\347\266\234\345\220\210\346\250\231\351\237\263/\351\226\251\345\215\227\350\252\236\345\255\227\347\266\234\345\220\210\346\250\231\351\237\263.py"
# @@ -49,8 +49,8 @@
# -			self.臺羅數字調 = 臺羅.音標
# -			self.吳守禮方音 = 臺羅.產生吳守禮方音物件().產生音標組字式()
# -			self.臺羅閏號調 = 臺羅.轉閏號調()
# -			self.通用數字調 = 臺羅.轉通用拼音()
# -			if not self.標音完整無():
# -				raise 解析錯誤('音標無合法：{0}，{1}，{2}，{3}，{4}，{5}'.
# -					format(字物件, self.型體, self.臺羅數字調, self.吳守禮方音,
# -					self.臺羅閏號調, self.通用數字調,))
# +			self.臺羅數字調 = 字物件.音
# +# 			self.吳守禮方音 = 臺羅.產生吳守禮方音物件().產生音標組字式()
# +# 			self.臺羅閏號調 = 臺羅.轉閏號調()
# +# 			self.通用數字調 = 臺羅.轉通用拼音()
# +# 			if not self.標音完整無():
# +# 				raise 解析錯誤('音標無合法：{0}，{1}，{2}，{3}，{4}，{5}'.
# +# 					format(字物件, self.型體, self.臺羅數字調, self.吳守禮方音,
# +# 					self.臺羅閏號調, self.通用數字調,))
# @@ -58,3 +58 @@
# -		return {"型體":self.型體, "臺羅數字調":self.臺羅數字調,
# -			"臺羅閏號調":self.臺羅閏號調, "通用數字調":self.通用數字調,
# -			"吳守禮方音":self.吳守禮方音}
# +		return {"型體":self.型體, "臺羅數字調":self.臺羅數字調,}
