# -*- coding: utf-8 -*-
from 校對.華臺斷詞 import 華臺斷詞
from 臺灣言語工具.表單.型音辭典 import 型音辭典
from 臺灣言語工具.斷詞.上長詞優先辭典揣詞 import 上長詞優先辭典揣詞
from 臺灣言語工具.表單.尾字辭典 import 尾字辭典
from 臺灣言語工具.斷詞.尾字辭典揣詞 import 尾字辭典揣詞
from 翻譯研究.讀語料 import 讀語料
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
class 斷詞評分:
	_讀語料 = 讀語料()
	_分析器 = 拆文分析器()
	def 評分(self, 答案, 結果):
		答案數量 = 0
		結果數量 = 0
		著數量 = 0
		for 答, 結 in zip(self._讀語料.讀語料檔案(答案), self._讀語料.讀語料檔案(結果)):
			答案集合 = self.算分詞(答)
			結果集合 = self.算分詞(結)
			答案數量 += len(答案集合)
			結果數量 += len(結果集合)
			著數量 += len(答案集合 & 結果集合)
		召回 = 著數量 / 答案數量
		精準 = 著數量 / 結果數量
		F = 2 * 召回 * 精準 / (召回 + 精準)
		print(結果)
		print('召回', 召回 * 100)
		print('精準', 精準 * 100)
		print('F', F * 100)
	def 算分詞(self, 分詞):
		組物件 = self._分析器.轉做組物件(分詞)
		集合 = set()
		所在 = 0
		for 詞物件 in 組物件.內底詞:
			開始 = 所在
			所在 += len(詞物件.內底字)
			結束 = 所在
			集合.add((開始, 結束))
		return 集合
if __name__ == '__main__':
	_斷詞評分 = 斷詞評分()
	_斷詞評分.評分('../語料/例句一對一.txt.gz', '../語料/例句一對一拄好斷詞.txt.gz')
	_斷詞評分.評分('../語料/例句一對一.txt.gz', '../語料/例句一對一上長詞對前斷詞.txt.gz')
	_斷詞評分.評分('../語料/例句一對一.txt.gz', '../語料/例句一對一上長詞對後斷詞.txt.gz')
