# -*- coding: utf-8 -*-
from 校對.華臺斷詞 import 華臺斷詞
from 臺灣言語工具.表單.型音辭典 import 型音辭典
from 臺灣言語工具.斷詞.上長詞優先辭典揣詞 import 上長詞優先辭典揣詞
from 臺灣言語工具.表單.尾字辭典 import 尾字辭典
from 臺灣言語工具.斷詞.尾字辭典揣詞 import 尾字辭典揣詞
from 翻譯研究.讀語料 import 讀語料
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器

if __name__ == '__main__':
	華臺斷字詞 = 華臺斷詞()
	辭典 = 型音辭典(4)
	倒辭典 = 尾字辭典(型音辭典)(4)
	_讀語料 = 讀語料()
	分析器 = 拆文分析器()
	for 一逝 in _讀語料.讀語料檔案('../語料/辭典一對一.txt.gz'):
		組物件 = 分析器.轉做組物件(一逝)
		for 詞物件 in 組物件.內底詞:
			print(詞物件)
			辭典.加詞(詞物件)
			倒辭典.加詞(詞物件)
	華臺斷字詞.處理音標(辭典,
		'../語料/例句一對一.txt.gz', '../語料/例句一對一拄好斷詞.txt.gz')
	華臺斷字詞.處理音標(辭典,
		'../語料/例句一對一.txt.gz', '../語料/例句一對一上長詞對前斷詞.txt.gz',
		上長詞優先辭典揣詞)
	
	華臺斷字詞.處理音標(倒辭典,
		'../語料/例句一對一.txt.gz', '../語料/例句一對一上長詞對後斷詞.txt.gz',
		尾字辭典揣詞(上長詞優先辭典揣詞))
	
