from 處理TGB.資料檔 import 資料檔
from 臺灣言語工具.解析整理.文章粗胚 import 文章粗胚
from 臺灣言語工具.音標系統.閩南語.教會羅馬字音標 import 教會羅馬字音標
from 翻譯研究.讀語料 import 讀語料
from 臺灣言語工具.解析整理.物件譀鏡 import 物件譀鏡
from 臺灣言語工具.翻譯.摩西工具.語句編碼器 import 語句編碼器
from 臺灣言語工具.翻譯.摩西工具.摩西用戶端 import 摩西用戶端
from 翻譯研究.一逝翻譯 import 一逝翻譯
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 對齊TGB.翻譯評分對齊介面 import 翻譯評分對齊介面
import itertools
from 對齊TGB.空白斷詞分析器 import 空白斷詞分析器
from 臺灣言語工具.基本元素.公用變數 import 分詞符號
from 資料處理.斷一對一字 import 斷一對一字

class 對齊語料:
	_資料檔 = 資料檔()
	_讀語料 = 讀語料()
	_分析器 = 拆文分析器()
	_粗胚 = 文章粗胚()
	_譀鏡 = 物件譀鏡()
	_斷一對一字 = 斷一對一字()

	_翻譯評分對齊介面 = 翻譯評分對齊介面()
	_編碼器 = 語句編碼器()
	翻做國語埠 = 8301
	翻做國語用戶端 = None
	國語檔名 = '../語料/TGB/分開對齊/{0:04}.國'
	閩南語檔名 = '../語料/TGB/分開對齊/{0:04}.閩'
	翻國語檔名 = '../語料/TGB/分開對齊/{0:04}.翻國語'
	翻閩南語檔名 = '../語料/TGB/分開對齊/{0:04}.翻閩南'
	對齊段國語檔名 = '../語料/TGB/分開對齊/{0:04}.對齊段國語'
	對齊段閩南語檔名 = '../語料/TGB/分開對齊/{0:04}.對齊段閩南'
	對齊句國語檔名 = '../語料/TGB/分開對齊/{0:04}.對齊句國語'
	對齊句閩南語檔名 = '../語料/TGB/分開對齊/{0:04}.對齊句閩南'
	def __init__(self):
		self.翻做閩南 = 一逝翻譯(8205, 8105)
		self.翻做國語用戶端 = 摩西用戶端('localhost', self.翻做國語埠)
	def 產生翻譯(self, 編號):
		self.產生兩爿翻譯(
			self.國語檔名.format(編號),
			self.閩南語檔名.format(編號),
			self.翻國語檔名.format(編號),
			self.翻閩南語檔名.format(編號))
	def 產生兩爿翻譯(self, 國語檔名, 閩南語檔名, 翻國語檔名, 翻閩南語檔名):
		國語翻閩南語 = []
		for 國語斷詞 in 	self._讀語料.讀語料檔案(國語檔名):
			翻譯結果 = self.翻做閩南.譯(國語斷詞)
			print(翻譯結果)
			國語翻閩南語.append(翻譯結果)
		self._讀語料.寫語料檔案(翻閩南語檔名,
			'\n'.join(國語翻閩南語))
		閩南語翻國語 = []
		for 閩南語斷詞 in self._讀語料.讀語料檔案(閩南語檔名):
			翻譯結果 = self.翻做國語用戶端.翻譯(
				閩南語斷詞, self._編碼器,)
			整理結果 = []
			for 國語詞 in 翻譯結果['text'].split():
				if self.翻做國語用戶端.是未知詞(國語詞):
					閩南語分詞 = self.翻做國語用戶端.提掉後壁未知詞記號(國語詞)
					詞物件 = self._分析器.轉做詞物件(閩南語分詞)
					整理結果.append(self._譀鏡.看型(詞物件))
				else:
					整理結果.append(國語詞)
			閩南語翻國語.append(' '.join(整理結果))
# 講-來｜kong2-lai5|UNK|UNK|UNK
			print(閩南語翻國語[-1])
		self._讀語料.寫語料檔案(翻國語檔名,
			'\n'.join(閩南語翻國語))
	def 對齊段(self, 編號):
		self._翻譯評分對齊介面.對齊(
			self.國語檔名.format(編號),
			self.閩南語檔名.format(編號),
			[self.翻閩南語檔名.format(編號)],
			[self.翻國語檔名.format(編號)],
			self.對齊段國語檔名.format(編號),
			self.對齊段閩南語檔名.format(編號))
	def 對齊一逝一逝(self, 編號):
		國語逝檔 = '../語料/TGB/分開對齊/國語逝'
		閩南逝檔 = '../語料/TGB/分開對齊/閩南逝'
		閩南字逝檔 = '../語料/TGB/分開對齊/閩南字逝'
		翻國語逝檔 = '../語料/TGB/分開對齊/翻國語逝'
		翻閩南逝檔 = '../語料/TGB/分開對齊/翻閩南逝'
		翻閩南字逝檔 = '../語料/TGB/分開對齊/翻閩南字逝'
		齊國語逝檔 = '../語料/TGB/分開對齊/齊國語逝'
		齊閩南逝檔 = '../語料/TGB/分開對齊/齊閩南逝'
		上尾國語句 = []
		上尾閩南句 = []
		for 國語分詞, 閩南分詞 in zip(
				self._讀語料.讀語料檔案(
					self.對齊段國語檔名.format(編號)),
				self._讀語料.讀語料檔案(
					self.對齊段閩南語檔名.format(編號))
				):
			_空白斷詞分析器 = 空白斷詞分析器()
			國語物件 = _空白斷詞分析器.切出章物件(國語分詞)
			國語句 = []
			for 句物件 in 國語物件.內底句:
				國語句.append(
					self._譀鏡.看型(句物件, 物件分詞符號 = 分詞符號))
			self._讀語料.寫語料檔案(國語逝檔,
				'\n'.join(國語句))

			閩南物件 = self._分析器.轉做章物件(閩南分詞)
			閩南句 = []
			for 句物件 in 閩南物件.內底句:
				閩南句.append(self._譀鏡.看斷詞(句物件))
			self._讀語料.寫語料檔案(閩南逝檔,
				'\n'.join(閩南句))
			self.產生兩爿翻譯(國語逝檔, 閩南逝檔,
				翻國語逝檔, 翻閩南逝檔)
			self.斷詞轉斷字(閩南逝檔, 閩南字逝檔)
			self.斷詞轉斷字(翻閩南逝檔,翻閩南字逝檔)
			self._翻譯評分對齊介面.對齊(
				國語逝檔,
				閩南逝檔,
				[翻閩南逝檔],
				[翻國語逝檔],
				齊國語逝檔,
				齊閩南逝檔,
				)
# 			self._翻譯評分對齊介面.對齊(
# 				國語逝檔,
# 				閩南字逝檔,
# 				[翻閩南字逝檔],
# 				[翻國語逝檔],
# 				齊國語逝檔,
# 				齊閩南逝檔,
# 				)
			上尾國語句.append(self._讀語料.讀語料檔案(齊國語逝檔))
			上尾閩南句.append(self._讀語料.讀語料檔案(齊閩南逝檔))
			a = self._讀語料.讀語料檔案(齊國語逝檔)
			print(a)
			if len(a) > 0:
				break
		self._讀語料.寫語料檔案(self.對齊句國語檔名.format(編號),
			'\n'.join(itertools.chain.from_iterable(上尾國語句)))
		self._讀語料.寫語料檔案(self.對齊句閩南語檔名.format(編號),
			'\n'.join(itertools.chain.from_iterable(上尾閩南句)))
	def 斷詞轉斷字(self, 斷詞, 斷字):
		斷字資料 = []
		for 一句 in self._讀語料.讀語料檔案(斷詞):
			斷字句 = self._斷一對一字.斷字(一句)
			斷字資料.append(斷字句)
		self._讀語料.寫語料檔案(斷字, '\n'.join(斷字資料))
if __name__ == '__main__':
	TGB = 對齊語料()
# 	TGB.段落字分析('../語料/TGB/原來TGB.json.gz', '../語料/TGB/分數.json.gz')
	編 = 1166
# 	TGB.產生翻譯(編)
# 	TGB.對齊段(編)
	TGB.對齊一逝一逝(編)
